blog/org-styling.org
#+TITLE: Org Style Demo
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/org.css"/>

#+BEGIN_abstract
A custom org css stylesheet to bring it to visual parity with the rest of my
website. The org template is borrowed from [[https://gongzhitaao.org/orgcss/]].

#+END_abstract

# now prints out the previously disabled (toc:nil) table of contents.
#+TOC: headlines 2

* Usage & Copyright
If you want to use this stylesheet, feel free to add this line to your .org file:
#+begin_src org
,#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://seanzhang.ca/org.css"/>
#+end_src

If you discover any bugs, feel free to let me know either directly or through [[https://github.com/sean01zhang/sean01zhang.github.io/issues][Github]].

* TODO Todos are Nice
** DONE Nesting
Under this section is some plain text. A few things:
1. Numbered List.
2. How about nesting some unordered lists?
   - Like this
   - and this
** No TODO here :tag2:
#+begin_quote
Something can be quoted here. Another use for this might be in-line notes.
#+end_quote

There are ~some monospaced~ text blocks here. Code block examples:
#+BEGIN_SRC c++
#include <iostream>

int main() {
  std::cout << "hello world" << std::endl;
  return 0;
}
#+END_SRC

Rust:
#+begin_src rust
fn main() {
    println!("Hello world");
    for i in 1..2 {
        continue;
    }
}
#+end_src

JSON
#+begin_src json
{
  "name": "Example",
  "a_list": [
    1, 2, 3,
  ],
  "message": {
    "w": "orld"
  }
}
#+end_src

Here's a table I borrowed:

#+CAPTION: Utilities
#+NAME: tab:util
| Utility     | Description                                     |
|-------------+-------------------------------------------------|
| [[https://www.lri.fr/~filliatr/bibtex2html/][bibtex2html]] | Export citations in bib files, if any, to html. |
| [[https://www.mathjax.org/][MathJax]]     | Render math equations.                          |

*** Some Math
**** The Rendering Eqauation
\begin{align*}
L_o(x_i) = L_i(x_i) + L_e()
\end{align*}

This is an inline thing $4^e$

# note the ignore tag
* Code not working
#+begin_src json
{
  "name": "Example",
  "a_list": [
    1, 2, 3,
  ],
  "message": {
    "w": "orld"
  }
}
#+end_src


* References :ignore:

# prints out bibliograph, if any, with bibtex2html.  The first parameter is the
# bibliograph file name without .bib extension, the second is the reference
# style.  The rest parameters are parsed to `bibtex2html'.  Refer to the
# ox-bibtex document for further information.

#+BIBLIOGRAPHY: ref plain limit:t option:-nokeywords

# This is an automatically generated section if you use footnote.
* Footnotes
