blog/org-styling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-15 Mon 21:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Style Demo</title>
<meta name="author" content="Sean Zhang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Org Style Demo</h1>
<div class="abstract" id="org861a0b3">
<p>
A custom org css stylesheet to bring it to visual parity with the rest of my
website. The org template is borrowed from <a href="https://gongzhitaao.org/orgcss/">https://gongzhitaao.org/orgcss/</a>.
</p>

</div>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org78ddcf1">1. Usage &amp; Copyright</a></li>
<li><a href="#org0546fbd">2. <span class="todo TODO">TODO</span> Todos are Nice</a>
<ul>
<li><a href="#org6688772">2.1. <span class="done DONE">DONE</span> Nesting</a></li>
<li><a href="#org427804d">2.2. No TODO here&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tag2">tag2</span></span></a></li>
</ul>
</li>
<li><a href="#org5d5de77">3. Code not working</a></li>
<li><a href="#org85bd730">4. References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ignore">ignore</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-org78ddcf1" class="outline-2">
<h2 id="org78ddcf1"><span class="section-number-2">1.</span> Usage &amp; Copyright</h2>
<div class="outline-text-2" id="text-1">
<p>
If you want to use this stylesheet, feel free to add this line to your .org file:
</p>
<div class="org-src-container">
<pre class="src src-org">+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="<span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="https://seanzhang.ca/org.css&quot;/">https://seanzhang.ca/org.css"/</a></span>&gt;
</pre>
</div>

<p>
If you discover any bugs, feel free to let me know either directly or through <a href="https://github.com/sean01zhang/sean01zhang.github.io/issues">Github</a>.
</p>
</div>
</div>
<div id="outline-container-org0546fbd" class="outline-2">
<h2 id="org0546fbd"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Todos are Nice</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6688772" class="outline-3">
<h3 id="org6688772"><span class="section-number-3">2.1.</span> <span class="done DONE">DONE</span> Nesting</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Under this section is some plain text. A few things:
</p>
<ol class="org-ol">
<li>Numbered List.</li>
<li>How about nesting some unordered lists?
<ul class="org-ul">
<li>Like this</li>
<li>and this</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org427804d" class="outline-3">
<h3 id="org427804d"><span class="section-number-3">2.2.</span> No TODO here&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tag2">tag2</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
Something can be quoted here. Another use for this might be in-line notes.
</p>
</blockquote>

<p>
There are <code>some monospaced</code> text blocks here. Code block examples:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #51afef;">&lt;</span><span style="color: #98be65;">iostream</span><span style="color: #51afef;">&gt;</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"hello world"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
  <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Rust:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #51afef;">fn</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #c678dd;">println!</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"Hello world"</span><span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">i</span> <span style="color: #51afef;">in</span> <span style="color: #da8548; font-weight: bold;">1</span>..<span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">continue</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
JSON
</p>
<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"name"</span>: <span style="color: #98be65;">"Example"</span>,
  <span style="color: #51afef;">"a_list"</span>: [
    <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>,
  ],
  <span style="color: #51afef;">"message"</span>: {
    <span style="color: #51afef;">"w"</span>: <span style="color: #98be65;">"orld"</span>
  }
}
</pre>
</div>

<p>
Here&rsquo;s a table I borrowed:
</p>

<table id="orgefca214" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Utilities</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Utility</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://www.lri.fr/~filliatr/bibtex2html/">bibtex2html</a></td>
<td class="org-left">Export citations in bib files, if any, to html.</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.mathjax.org/">MathJax</a></td>
<td class="org-left">Render math equations.</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orge6f9a40" class="outline-4">
<h4 id="orge6f9a40"><span class="section-number-4">2.2.1.</span> Some Math</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<div id="outline-container-org6ed6c02" class="outline-5">
<h5 id="org6ed6c02">The Rendering Eqauation</h5>
<div class="outline-text-5" id="text-org6ed6c02">
\begin{align*}
L_o(x_i) = L_i(x_i) + L_e()
\end{align*}

<p>
This is an inline thing \(4^e\)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org5d5de77" class="outline-2">
<h2 id="org5d5de77"><span class="section-number-2">3.</span> Code not working</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"name"</span>: <span style="color: #98be65;">"Example"</span>,
  <span style="color: #51afef;">"a_list"</span>: [
    <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>,
  ],
  <span style="color: #51afef;">"message"</span>: {
    <span style="color: #51afef;">"w"</span>: <span style="color: #98be65;">"orld"</span>
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org85bd730" class="outline-2">
<h2 id="org85bd730"><span class="section-number-2">4.</span> References&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ignore">ignore</span></span></h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sean Zhang (<a href="mailto:sean@v1040-wn-rt-b-97-44.campus-dynamic.uwaterloo.ca">sean@v1040-wn-rt-b-97-44.campus-dynamic.uwaterloo.ca</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.7)</p>
<p class="validation"></p>
</div>
</body>
</html>